
export const fullCategoryStructure = {
  "Одежда": {
    "Верхняя одежда": {
      "Пальто": {},
      "Тренчи": {},
      "Парки": {},
      "Пуховики": {},
      "Куртки": {},
      "Жилеты": {},
      "Плащи": {},
      "Дождевики": {},
      "Пончо": {},
      "Шубы": {},
      "Лайнеры": {},
      "Подстёжки": {},
      "Комбинезоны": {}
    },
    "Костюмы и жакеты": {
      "Костюмы": {},
      "Пиджаки": {},
      "Блейзеры": {},
      "Смокинги": {},
      "Фрак": {}
    },
    "Платья": {},
    "Сарафаны": {},
    "Юбки": {},
    "Рубашки и блузы": {
      "Рубашки": {},
      "Блузы": {},
      "Сорочки": {}
    },
    "Топы": {
      "Топы": {},
      "Майки": {},
      "Кроп-топы": {}
    },
    "Футболки": {
      "Футболки": {},
      "Поло": {}
    },
    "Джинсы": {},
    "Брюки": {
      "Чиносы": {},
      "Джоггеры": {},
      "Карго": {}
    },
    "Трикотаж": {
      "Свитеры": {},
      "Худи": {},
      "Кардиганы": {},
      "Водолазки": {}
    },
    "Нижнее бельё": {
      "Бюстгальтеры": {},
      "Трусы": {},
      "Комплекты": {},
      "Утягивающее бельё": {}
    },
    "Спортивная одежда": {
      "Леггинсы": {},
      "Топы": {},
      "Футболки": {},
      "Шорты": {},
      "Худи": {}
    },
    "Комбинезоны": {},
    "Боди": {},
    "Шорты": {},
    "Пляжная мода": {
      "Купальники": {},
      "Плавки": {},
      "Парео": {},
      "Платья": {},
      "Шорты": {}
    },
    "Пижамы и домашняя одежда": {
      "Халаты": {},
      "Лонгсливы": {},
      "Комплекты": {}
    },
  },
  "Обувь": {
    "Кроссовки": {},
    "Туфли": {
      "Дерби": {},
      "Оксфорды": {},
      "Лоферы": {},
      "Балетки": {}
    },
    "Ботинки": {
      "Челси": {},
            "Хайкеры": {},
      "Мартенсы": {}
    },
    "Сандалии и шлёпанцы": {
      "Сандалии": {},
      "Шлепанцы": {},
      "Босоножки": {}
    },
    "Сапоги": {
      "—": {},
      "Ботфорты": {},
      "Полусапоги": {}
    },
    "Повседневная": {
      "Слипоны": {},
      "Эспадрильи": {},
      "Мюли": {},
      "Сабо": {},
      "Домашняя": {}
    },
    "Спортивная": {}
  },
  "Сумки": {
    "Повседневные": {
      "Тот": {},
      "Шоппер": {},
      "Кросс-боди": {},
      "Рюкзак": {},
      "Клатч": {},
      "Поясная": {},
    },
    "Рабочие": {
      "Для ноутбука": {},
      "Портфель": {}
    },
    "Спортивные и дорожные": {
      "Чемоданы": {},
      "Дорожные сумки": {},
      "Косметички": {},
      "Несессеры": {}
    }
  },
  "Аксессуары": {
    "Очки": {},
    "Ремни": {},
    "Перчатки": {},
    "Шарфы": {},
    "Галстуки": {},
    "Платки": {},
    "Украшения": {},
    "Часы и гаджеты": {},
    "Головные уборы": {
      "Кепки": {},
      "Панамы": {},
      "Шляпы": {},
      "Береты": {},
      "Шапки": {}
    },
    "Носочно-чулочные": {
      "Носки": {},
      "Колготки": {},
      "Чулки": {},
      "Гольфы": {},
      "Гетры": {}
    },
    "Кожгалантерея мелкая": {
      "Кошельки": {},
      "Портмоне": {},
      "Кардхолдеры": {},
      "Монетницы": {},
      "Ключницы": {}
    },
    "Зонты": {},
    "Тех-аксессуары": {},
    "Маски и бафы": {
      "Маски": {},
      "Балаклавы": {},
      "Бафы": {}
    }
  },
  "Красота и уход": {
    "Парфюмерия": {},
    "Косметика": {
      "Лицо": {},
      "Глаза": {},
      "Губы": {}
    },
    "Уход": {
      "Кожа": {},
      "Волосы": {},
      "Тело": {}
    }
  },
  "Игрушки": {},
  "Аксессуары для новорожденных": {
    "Коляски": {
      "—": {},
      "Аксессуары для колясок": {}
    },
    "Бутылочки и кормление": {
      "Бутылочки": {},
      "Поильники": {},
      "Стерилизаторы": {},
      "Подогреватели": {}
    },
    "Пеленки и уход": {
      "Пеленки": {},
      "Подгузники": {}
    },
    "Гаджеты": {}
  },
  "Дом и стиль жизни": {
    "Текстиль": {
      "Пледы": {},
      "Скатерти": {},
      "Постельное": {},
      "Полотенца": {},
      "Коврики для ванной": {},
      "Шторы": {},
      "Ковры": {},
      "Матрасы": {},
      "Подушки": {},
      "Одеяла": {}
    },
    "Декор": {
      "Свечи": {},
      "Диффузоры": {},
      "Вазы": {},
      "Рамки": {},
      "Органайзеры": {}
    },
    "Питомцы": {
      "Одежда": {},
      "Лежанки": {},
      "Переноски": {},
      "Поводки": {},
      "Обувь": {}
    },
    "Lifestyle-гаджеты": {}
  }
};





